# Created by Freeknight
# Date: 2021/12/13
# Desc：加载自定义Icon
# @category: 辅助类
#--------------------------------------------------------------------------------------------------
tool
extends Node
### Member Variables and Dependencies -------------------------------------------------------------
#--- signals --------------------------------------------------------------------------------------
#--- enums ----------------------------------------------------------------------------------------
#--- constants ------------------------------------------------------------------------------------
#--- public variables - order: export > normal var > onready --------------------------------------
#--- private variables - order: export > normal var > onready -------------------------------------
### -----------------------------------------------------------------------------------------------

### Built in Engine Methods -----------------------------------------------------------------------
func _ready():
	pass
### -----------------------------------------------------------------------------------------------

### Public Methods --------------------------------------------------------------------------------
func load_icon_from_name(icon_name : String) -> ImageTexture:
	var file = File.new()
	var image = Image.new()
	var texture = ImageTexture.new()
	
	file.open("res://addons/FKEditor_FileEditor/Assets/Icons/"+icon_name+".png.buttonicon", File.READ)
	var buffer = file.get_buffer(file.get_len())
	file.close()
	
	image.load_png_from_buffer(buffer)
	texture.create_from_image(image)
	return texture
### -----------------------------------------------------------------------------------------------

### Private Methods -------------------------------------------------------------------------------
### -----------------------------------------------------------------------------------------------
